---
kind: type
id: T:Autodesk.Revit.DB.TransactionStatus
source: html/29b9a7a8-6754-8310-e063-622b569bb6d5.htm
---
# Autodesk.Revit.DB.TransactionStatus

An enumerated type listing the possible statuses associated with a Transaction, TransactionGroup, or SubTransaction,
 or the result of a particular method call on one of those objects.

## Syntax (C#)
```csharp
public enum TransactionStatus
```